app/controllers/posts_controller.rb

  def index
    @title = "Notícies"
    @posts = Post.paginate(:page => params[:page])
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 30 OFFSET 0

  def create
    @post = current_user.posts.build(params[:post])
    if @post.save
---
INSERT INTO "posts" ("updated_at", "user_id", "title", "created_at", "content") VALUES ('2012-02-29 04:09:00.111588', 1, 'Notícia de prova 4', '2012-02-29 04:09:00.111588', 'woef neowfi enwfo iwjdspfiap oaiejf paoeij

  def destroy
    Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = 5
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 5 ORDER BY created_at DESC LIMIT 1