app/controllers/users_controller.rb

  def create
    @user = User.new(params[ :user])
    if @user.save
---
INSERT INTO "users" ("year", "admin", "name", "encrypted_password", "work", "email", "likes", "linkedin", "updated_at", "degree", "salt", "abroad", "created_at") VALUES (NULL, 'f', 'Pau', '135a1b03a164cbd3e8c52ea1d6157100afda48b08e2c6dd2b0901d029f7a3a26', NULL, 'pau@cfis.edu', NULL, NULL, '2012-02-24 02:29:04.085218', NULL, '1c05b1b90d8997790fda312471fc35b981e59868bcb88aee896d97f69f216e1d', NULL, '2012-02-24 02:29:04.085218')

  def index
    @title = "Tots els alumni"
    search_p=User.search(params[:search])
    if !search_p.empty?
       users_relation=User.where(search_p[0],search_p[1])
       if users_relation.empty?
          flash.now[:notice] = "No s'ha trobat cap resultat, es mostra el directori complet."
         users_relation = User
       end
    else
       users_relation = User
    end
    @users = users_relation.paginate(:page=>params[:page],:per_page=>10)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users" WHERE (LOWER(name) LIKE '%oweifj%')
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0

  def update
    @user=User.find(params[ :id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
UPDATE "users" SET "salt" = '29cab4eb4ee08a12ddb6015f7b3ecc04a3e84a09c2f8153883ac30fa73839970', "encrypted_password" = '39fa1325f72bdec5c9bc7efcb26bf1a66372e9e60ddc43a6d34ddc7b19cef18a', "updated_at" = '2011-09-21 15:10:52.607528' WHERE "users"."id" = 8